# SELECT within SELECT

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

 ·········

## 1. Bigger than Russia

**List each country name where the population is larger than that of 'Russia'.**

```
world(name, continent, area, population, gdp)
```

In [2]:
%%sql
SELECT name FROM world
  WHERE population > (SELECT population FROM world WHERE name='Russia')

 * postgresql://postgres:***@localhost/sqlzoo
8 rows affected.

[('Bangladesh',),
 ('Brazil',),
 ('China',),
 ('India',),
 ('Indonesia',),
 ('Nigeria',),
 ('Pakistan',),
 ('United States',)]

## 2. Richer than UK

**Show the countries in Europe with a per capita GDP greater than 'United Kingdom'.**

> _Per Capita GDP_   
> The per capita GDP is the gdp/population

In [3]:
%%sql
SELECT name FROM world
WHERE gdp/population > 
 (SELECT gdp/population FROM world WHERE name = 'United Kingdom') 
    AND continent = 'Europe'

 * postgresql://postgres:***@localhost/sqlzoo
17 rows affected.

[('Andorra',),
 ('Austria',),
 ('Belgium',),
 ('Denmark',),
 ('Finland',),
 ('France',),
 ('Germany',),
 ('Iceland',),
 ('Ireland',),
 ('Liechtenstein',),
 ('Luxembourg',),
 ('Monaco',),
 ('Netherlands',),
 ('Norway',),
 ('San Marino',),
 ('Sweden',),
 ('Switzerland',)]

## 3. Neighbours of Argentina and Australia


List the name and continent of countries in the continents containing either Argentina or Australia. Order by name of the country.

In [4]:
%%sql
SELECT name, continent FROM world
WHERE continent IN 
 (SELECT continent FROM world WHERE name IN ('Argentina', 'Australia'))
ORDER BY name

 * postgresql://postgres:***@localhost/sqlzoo
27 rows affected.

[('Argentina', 'South America'),
 ('Australia', 'Oceania'),
 ('Bolivia', 'South America'),
 ('Brazil', 'South America'),
 ('Chile', 'South America'),
 ('Colombia', 'South America'),
 ('Ecuador', 'South America'),
 ('Fiji', 'Oceania'),
 ('Guyana', 'South America'),
 ('Kiribati', 'Oceania'),
 ('Marshall Islands', 'Oceania'),
 ('Micronesia, Federated States of', 'Oceania'),
 ('Nauru', 'Oceania'),
 ('New Zealand', 'Oceania'),
 ('Palau', 'Oceania'),
 ('Papua New Guinea', 'Oceania'),
 ('Paraguay', 'South America'),
 ('Peru', 'South America'),
 ('Saint Vincent and the Grenadines', 'South America'),
 ('Samoa', 'Oceania'),
 ('Solomon Islands', 'Oceania'),
 ('Suriname', 'South America'),
 ('Tonga', 'Oceania'),
 ('Tuvalu', 'Oceania'),
 ('Uruguay', 'South America'),
 ('Vanuatu', 'Oceania'),
 ('Venezuela', 'South America')]

## 4. Between Canada and Poland

Which country has a population that is more than Canada but less than Poland? Show the name and the population.

In [5]:
%%sql
SELECT name, population FROM world
WHERE population > 
 (SELECT population FROM world WHERE name = 'Canada') 
    AND population <
    (SELECT population FROM world WHERE name = 'Poland')

 * postgresql://postgres:***@localhost/sqlzoo
2 rows affected.

[('Iraq', Decimal('36004552')), ('Sudan', Decimal('37289406'))]

## 5. Percentages of Germany

Germany (population 80 million) has the largest population of the countries in Europe. Austria (population 8.5 million) has 11% of the population of Germany.

**Show the name and the population of each country in Europe. Show the population as a percentage of the population of Germany.**

The format should be Name, Percentage for example:

name	| percentage
--------|-----------
Albania	| 3%
Andorra	| 0%
Austria	| 11%
...	| ...

> _Decimal places_   
> You can use the function ROUND to remove the decimal places.

> _Percent symbol %_   
> You can use the function CONCAT to add the percentage symbol.

[To get a well rounded view of the important features of SQL you should move on to the next tutorial concerning aggregates.](https://sqlzoo.net/wiki/SUM_and_COUNT)

To gain an absurdly detailed view of one insignificant feature of the language, read on.

We can use the word `ALL` to allow >= or > or < or <=to act over a list. For example, you can find the largest country in the world, by population with this query:

```sql
SELECT name
  FROM world
 WHERE population >= ALL(SELECT population
                           FROM world
                          WHERE population>0)
```

You need the condition **population>0** in the sub-query as some countries have **null** for population.

In [6]:
%%sql
SELECT name, 
 CONCAT(ROUND(100 * population/(SELECT population FROM world WHERE name = 'Germany'), 0), '%') AS pct
    FROM world
    WHERE continent = 'Europe'

 * postgresql://postgres:***@localhost/sqlzoo
44 rows affected.

[('Albania', '3%'),
 ('Andorra', '0%'),
 ('Austria', '11%'),
 ('Belarus', '12%'),
 ('Belgium', '14%'),
 ('Bosnia and Herzegovina', '5%'),
 ('Bulgaria', '9%'),
 ('Croatia', '5%'),
 ('Czech Republic', '13%'),
 ('Denmark', '7%'),
 ('Estonia', '2%'),
 ('Finland', '7%'),
 ('France', '82%'),
 ('Germany', '100%'),
 ('Greece', '14%'),
 ('Hungary', '12%'),
 ('Iceland', '0%'),
 ('Ireland', '6%'),
 ('Italy', '75%'),
 ('Kazakhstan', '21%'),
 ('Latvia', '2%'),
 ('Liechtenstein', '0%'),
 ('Lithuania', '4%'),
 ('Luxembourg', '1%'),
 ('Macedonia', '3%'),
 ('Malta', '1%'),
 ('Moldova', '4%'),
 ('Monaco', '0%'),
 ('Montenegro', '1%'),
 ('Netherlands', '21%'),
 ('Norway', '6%'),
 ('Poland', '48%'),
 ('Portugal', '13%'),
 ('Romania', '25%'),
 ('San Marino', '0%'),
 ('Serbia', '9%'),
 ('Slovakia', '7%'),
 ('Slovenia', '3%'),
 ('Spain', '58%'),
 ('Sweden', '12%'),
 ('Switzerland', '10%'),
 ('Ukraine', '53%'),
 ('United Kingdom', '79%'),
 ('Vatican City', '0%')]

## 6. Bigger than every country in Europe

Which countries have a GDP greater than every country in Europe? [Give the name only.] (Some countries may have NULL gdp values)

We can refer to values in the outer SELECT within the inner SELECT. We can name the tables so that we can tell the difference between the inner and outer versions.

In [7]:
%%sql
SELECT name FROM world
WHERE gdp > ALL(SELECT gdp FROM world WHERE continent = 'Europe' AND gdp>0)

 * postgresql://postgres:***@localhost/sqlzoo
3 rows affected.

[('China',), ('Japan',), ('United States',)]

## 7. Largest in each continent

**Find the largest country (by area) in each continent, show the continent, the name and the area:**

```sql
SELECT continent, name, population FROM world x
  WHERE population >= ALL
    (SELECT population FROM world y
        WHERE y.continent=x.continent
          AND population>0)
```

> __The above example is known as a correlated or synchronized sub-query.__   
> 
> Using correlated subqueries
> A correlated subquery works like a nested loop: the subquery only has access to rows related to a single > record at a time in the outer query. The technique relies on table aliases to identify two different uses of the same table, one in the outer query and the other in the subquery.
> 
> One way to interpret the line in the **WHERE** clause that references the two table is _“… where the correlated values are the same”._
> 
> In the example provided, you would say _“select the country details from world where the population is greater than or equal to the population of all countries where the continent is the same”._

In [8]:
%%sql
SELECT continent, name, area FROM world x
  WHERE area >= ALL
    (SELECT area FROM world y
       WHERE y.continent=x.continent AND area>0)

 * postgresql://postgres:***@localhost/sqlzoo
8 rows affected.

[('Africa', 'Algeria', Decimal('2381741')),
 ('Oceania', 'Australia', Decimal('7692024')),
 ('South America', 'Brazil', Decimal('8515767')),
 ('North America', 'Canada', Decimal('9984670')),
 ('Asia', 'China', Decimal('9596961')),
 ('Caribbean', 'Cuba', Decimal('109884')),
 ('Europe', 'Kazakhstan', Decimal('2724900')),
 ('Eurasia', 'Russia', Decimal('17125242'))]

## 8. First country of each continent (alphabetically)

**List each continent and the name of the country that comes first alphabetically.**

In [9]:
%%sql
SELECT continent, name
FROM world x
WHERE name <= ALL
 (SELECT name FROM world y
  WHERE y.continent = x.continent AND y.name IS NOT NULL
  ORDER By name)

 * postgresql://postgres:***@localhost/sqlzoo
8 rows affected.

[('Asia', 'Afghanistan'),
 ('Europe', 'Albania'),
 ('Africa', 'Algeria'),
 ('Caribbean', 'Antigua and Barbuda'),
 ('South America', 'Argentina'),
 ('Eurasia', 'Armenia'),
 ('Oceania', 'Australia'),
 ('North America', 'Belize')]

## 9. Difficult Questions That Utilize Techniques Not Covered In Prior Sections

**Find the continents where all countries have a population <= 25000000. Then find the names of the countries associated with these continents. Show name, continent and population.**

In [10]:
%%sql
SELECT name, continent, population
FROM world x
WHERE continent NOT IN 
  (SELECT continent FROM world WHERE population > 25000000)

 * postgresql://postgres:***@localhost/sqlzoo
25 rows affected.

[('Antigua and Barbuda', 'Caribbean', Decimal('86295')),
 ('Australia', 'Oceania', Decimal('23545500')),
 ('Bahamas', 'Caribbean', Decimal('351461')),
 ('Barbados', 'Caribbean', Decimal('285000')),
 ('Cuba', 'Caribbean', Decimal('11167325')),
 ('Dominica', 'Caribbean', Decimal('71293')),
 ('Dominican Republic', 'Caribbean', Decimal('9445281')),
 ('Fiji', 'Oceania', Decimal('858038')),
 ('Grenada', 'Caribbean', Decimal('103328')),
 ('Haiti', 'Caribbean', Decimal('10413211')),
 ('Jamaica', 'Caribbean', Decimal('2717991')),
 ('Kiribati', 'Oceania', Decimal('106461')),
 ('Marshall Islands', 'Oceania', Decimal('56086')),
 ('Micronesia, Federated States of', 'Oceania', Decimal('101351')),
 ('Nauru', 'Oceania', Decimal('9945')),
 ('New Zealand', 'Oceania', Decimal('4538520')),
 ('Palau', 'Oceania', Decimal('20901')),
 ('Papua New Guinea', 'Oceania', Decimal('7398500')),
 ('Saint Lucia', 'Caribbean', Decimal('180000')),
 ('Samoa', 'Oceania', Decimal('187820')),
 ('Solomon Islands', 'Oceania', Decimal('581344')),
 ('Tonga', 'Oceania', Decimal('103036')),
 ('Trinidad and Tobago', 'Caribbean', Decimal('1328019')),
 ('Tuvalu', 'Oceania', Decimal('11323')),
 ('Vanuatu', 'Oceania', Decimal('264652'))]

## 10.

**Some countries have populations more than three times that of any of their neighbours (in the same continent). Give the countries and continents.**

In [11]:
%%sql
SELECT name, continent
FROM world x
WHERE population > ALL
  (SELECT population*3 FROM world y
   WHERE y.continent = x.continent AND area > 0 AND y.name <> x.name)

 * postgresql://postgres:***@localhost/sqlzoo
3 rows affected.

[('Australia', 'Oceania'), ('Brazil', 'South America'), ('Russia', 'Eurasia')]